src/main/resources/doOrderCreate_RTCokYolcu.text

<?xml version="1.0" encoding="UTF-8"?> <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.iata.org/IATA/EDIST/2017.2"> <soapenv:Header/> <soapenv:Body> <OrderCreateRQ xmlns="http://www.iata.org/IATA/EDIST/2017.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="xmldsig-core-schema.xsd" Version="IATA2017.2"> <Document> <Name>PC NDC GATEWAY</Name> <ReferenceVersion>1.0</ReferenceVersion> </Document> <Party> <Sender> <TravelAgencySender> <Contacts> <Contact> <EmailContact> <Address>craneNDC@flypgs.com</Address> </EmailContact> </Contact> </Contacts> <AgencyID>PC NDC</AgencyID> <AgentUser> <Name>HITITADMIN</Name> <AgentUserID>T621OC48</AgentUserID> <UserRole>ADMIN</UserRole> </AgentUser> </TravelAgencySender> </Sender> </Party> <Query> <Order> <Offer OfferID="replaceOffer_gidis" Owner="PC" ResponseID="replaceResponse_1"> <OfferItem OfferItemID="OFFERITEM1_1"> <PassengerRefs>SH1</PassengerRefs> </OfferItem> <OfferItem OfferItemID="OFFERITEM1_1"> <PassengerRefs>SH2</PassengerRefs> </OfferItem> <OfferItem OfferItemID="OFFERITEM1_1"> <PassengerRefs>SH3</PassengerRefs> </OfferItem> </Offer> <Offer OfferID="replaceOffer_donus" Owner="PC" ResponseID="replaceResponse_2"> <OfferItem OfferItemID="OFFERITEM1_1"> <PassengerRefs>SH1</PassengerRefs> </OfferItem> <OfferItem OfferItemID="OFFERITEM1_1"> <PassengerRefs>SH2</PassengerRefs> </OfferItem> <OfferItem OfferItemID="OFFERITEM1_1"> <PassengerRefs>SH3</PassengerRefs> </OfferItem> </Offer> </Order> <DataLists> <PassengerList> <Passenger PassengerID="SH1"> <PTC>ADT</PTC> <Birthdate>1990-01-01</Birthdate> <ResidenceCountryCode>TR</ResidenceCountryCode> <Individual> <GivenName>CENGIZHAN</GivenName> <Surname>YILMAZ</Surname> </Individual> <IdentityDocument> <IdentityDocumentNumber/> <IdentityDocumentType/> </IdentityDocument> <ContactInfoRef>CONT1</ContactInfoRef> <InfantRef>SH3</InfantRef> </Passenger> <Passenger PassengerID="SH2"> <PTC>CHD</PTC> <Birthdate>2016-01-01</Birthdate> <ResidenceCountryCode>TR</ResidenceCountryCode> <Individual> <GivenName>COCUK</GivenName> <Surname>YILMAZ</Surname> </Individual> <IdentityDocument> <IdentityDocumentNumber/> <IdentityDocumentType/> </IdentityDocument> <ContactInfoRef>CONT1</ContactInfoRef> </Passenger> <Passenger PassengerID="SH3"> <PTC>INF</PTC> <Birthdate>2022-01-01</Birthdate> <ResidenceCountryCode>TR</ResidenceCountryCode> <Individual> <GivenName>BEBEK</GivenName> <Surname>YILMAZ</Surname> </Individual> <IdentityDocument> <IdentityDocumentNumber/> <IdentityDocumentType/> </IdentityDocument> <ContactInfoRef>CONT1</ContactInfoRef> </Passenger> </PassengerList> <ContactList> <ContactInformation ContactID="CONT1"> <ContactProvided> <EmailAddress> <EmailAddressValue>cengizhan.yilmaz@testinium.com</EmailAddressValue> </EmailAddress> </ContactProvided> <ContactProvided> <Phone> <CountryDialingCode>90</CountryDialingCode> <AreaCode>555</AreaCode> <PhoneNumber>5555555</PhoneNumber> </Phone> </ContactProvided> </ContactInformation> </ContactList> </DataLists> <Metadata> <Other> <OtherMetadata> <CurrencyMetadatas> <CurrencyMetadata MetadataKey="TRY"/> </CurrencyMetadatas> </OtherMetadata> </Other> </Metadata> </Query> </OrderCreateRQ> </soapenv:Body> </soapenv:Envelope>